DEFAULT_CITY_LEVEL = 1
DEFAULT_CITY_INCOME = 20
DEFAULT_BALANCE = 210
MAXIMUM_CITY_LEVEL = 5

ROUND_TIME = 10 * 60
END_STAGE = 6
SEND_NUCLEAR_STAGE = 3

NUCLEAR_REACTOR_ECOLOGY = -3 # Единиц экологии
NUCLEAR_ROCKET_ECOLOGY = -5 # Единиц экологии
DONATE_ECOLOGY = 10 # Единиц экологии
DONATE_ECOLOGY_RAISE = 0.2 # + %
SANCTION_EFFECT = 0.1 # - %
CITY_INCOME_RAISE = 10 # Единиц валюты
CITY_PRICE_RAISE = 30 # Единиц валюты

DEBUG_MODE = False

PRICES = {
    "level_upgrade": 30,
    "air_defense": 60,
    "nuclear_reactor": 120,
    "nuclear_rocket": 40,
    "donate_ecology": 20,
    "send_sanction": 10,
    "country_spy": 20
}

CITIES = { # 1 город - столица
    "ru": [
        "Москва",
        "Санкт-Питербург",
        "Севастополь",
        "Екатеринбург"
    ],
    "cn": [
        "Пекин",
        "Гонконг",
        "Шанхай",
        "Ухань"
    ],
    "sp": [
        "Мадрид",
        "Барселона",
        "Севилья",
        "Валенсия"
    ],
    "de": [
        "Берлин",
        "Франкфурт",
        "Мюнхен",
        "Кельн"
    ],
    "us": [
        "Вашингтон",
        "Нью-Йорк",
        "Бостон",
        "Чикаго"
    ],
    "fr": [
        "Париж",
        "Марсель",
        "Лиль",
        "Нант"
    ],
    "ir": [
        "Тегеран",
        "Мешхед",
        "Исфахан",
        "Шираз"
    ],
    "pr": [
        "Лиссабон",
        "Порту",
        "Брага",
        "Лореш",
    ],
    "lt": [
        "Рим",
        "Милан",
        "Венеция",
        "Неаполь"
    ],
    "by": [
        "Минск",
        "Гомель",
        "Витебск",
        "Могилёв"
    ],
    "pa": [
        "Газа",
        "Хан-Юнис",
        "Джебалия",
        "Рафах",
    ],
    "rk": [
        "Пхеньян",
        "Хамхын",
        "Кэсон",
        "Синыйджу"
    ],
    "jp": [
        "Токио",
        "Осака",
        "Киото",
        "Чиба",
    ],
    "ng": [
        "Абуджа",
        "Ибадан",
        "Кано",
        "Порт-Харкорт"
    ]
}